In [1]:
import pandas as pd

In [4]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장 
exam_data = {'수학' : [ 90, 80, 70], '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100], '체육' : [ 100, 90, 90]}

In [5]:
df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

#### loc(), iloc()

iloc(integer location): 정수 기반 위치 인덱싱
iloc은 정수 기반의 위치 인덱싱을 사용하여 데이터를 선택합니다.
인덱스의 순서를 기반으로 데이터에 접근합니다.
시작 인덱스는 0부터 시작합니다.
슬라이싱을 사용하여 특정 범위의 행과 열을 선택할 수 있습니다.

loc(location): 레이블 기반 인덱싱
loc은 레이블 기반 인덱싱을 사용하여 데이터를 선택합니다.
인덱스의 레이블을 기반으로 데이터에 접근합니다.
레이블을 사용하여 특정 행과 열을 선택하거나 조건에 맞는 행을 필터링할 수 있습니다.

기본 형태 instance[ ] 안에
1) 개별 지정 선택(단일, 다수)을 하는 경우의 형식은 리스트 사용

2) 범위 선택을 하는 경우 [start:end:step]의 형태를 사용

In [6]:
label1 = df.loc['서준']    # loc 인덱서 활용
label1

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [17]:
label2 = df.loc[['서준', '인아']]
label2

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [22]:
# columns의 이름을 이용해서 범위를 잡는건 꽤 놀라움, columns 또는 인덱스로 정렬된 데이터에서는 사용하기 좋을 것 같음
label3 = df.loc['서준':'인아']
label3

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [7]:
position1 = df.iloc[0]     # iloc 인덱서 활용
position1

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [16]:
# 범위 지정 선택
position3 = df.iloc[0:2]
position3

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [14]:
# 개별 지정 선택
position4 = df.iloc[[0,2]]
position4

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90